<a href="https://colab.research.google.com/github/sanjibsinha/tensorflow-for-beginners/blob/google-colabs/read_and_write_tabular_data_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

titanic_train = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

print(titanic_train)

     survived     sex   age  n_siblings_spouses  parch     fare   class  \
0           0    male  22.0                   1      0   7.2500   Third
1           1  female  38.0                   1      0  71.2833   First
2           1  female  26.0                   0      0   7.9250   Third
3           1  female  35.0                   1      0  53.1000   First
4           0    male  28.0                   0      0   8.4583   Third
..        ...     ...   ...                 ...    ...      ...     ...
622         0    male  28.0                   0      0  10.5000  Second
623         0    male  25.0                   0      0   7.0500   Third
624         1  female  19.0                   0      0  30.0000   First
625         0  female  28.0                   1      2  23.4500   Third
626         0    male  32.0                   0      0   7.7500   Third

        deck  embark_town alone
0    unknown  Southampton     n
1          C    Cherbourg     n
2    unknown  Southampton     y
3          C  Southampton     n
4    unknown   Queenstown     y
..       ...          ...   ...
622  unknown  Southampton     y
623  unknown  Southampton     y
624        B  Southampton     y
625  unknown  Southampton     n
626  unknown   Queenstown     y

[627 rows x 10 columns]

In [2]:
titanic_eval = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/eval.csv")

print(titanic_eval)

     survived     sex   age  n_siblings_spouses  parch     fare   class  \
0           0    male  35.0                   0      0   8.0500   Third
1           0    male  54.0                   0      0  51.8625   First
2           1  female  58.0                   0      0  26.5500   First
3           1  female  55.0                   0      0  16.0000  Second
4           1    male  34.0                   0      0  13.0000  Second
..        ...     ...   ...                 ...    ...      ...     ...
259         1  female  25.0                   0      1  26.0000  Second
260         0    male  33.0                   0      0   7.8958   Third
261         0  female  39.0                   0      5  29.1250   Third
262         0    male  27.0                   0      0  13.0000  Second
263         1    male  26.0                   0      0  30.0000   First

        deck  embark_town alone
0    unknown  Southampton     y
1          E  Southampton     y
2          C  Southampton     y
3    unknown  Southampton     y
4          D  Southampton     y
..       ...          ...   ...
259  unknown  Southampton     n
260  unknown  Southampton     y
261  unknown   Queenstown     n
262  unknown  Southampton     y
263        C    Cherbourg     y

[264 rows x 10 columns]

In [8]:
first_five_rows = titanic_eval.head(5)

print(first_five_rows)

   survived     sex   age  n_siblings_spouses  parch     fare   class  \
0         0    male  35.0                   0      0   8.0500   Third
1         0    male  54.0                   0      0  51.8625   First
2         1  female  58.0                   0      0  26.5500   First
3         1  female  55.0                   0      0  16.0000  Second
4         1    male  34.0                   0      0  13.0000  Second

      deck  embark_town alone
0  unknown  Southampton     y
1        E  Southampton     y
2        C  Southampton     y
3  unknown  Southampton     y
4        D  Southampton     y

In [10]:
print(pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv").head(3))

   survived     sex   age  n_siblings_spouses  parch     fare  class     deck  \
0         0    male  22.0                   1      0   7.2500  Third  unknown
1         1  female  38.0                   1      0  71.2833  First        C
2         1  female  26.0                   0      0   7.9250  Third  unknown

   embark_town alone
0  Southampton     n
1    Cherbourg     n
2  Southampton     y

In [11]:
data_frame_shape = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

print(data_frame_shape.shape)

(627, 10)

## Trying to read from Pandas GitHub repo of CSV data

In [14]:
weather_quality_station = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/air_quality_stations.csv")

print(weather_quality_station)

                      location  coordinates.latitude  coordinates.longitude
0                      BELAL01              51.23619                4.38522
1                      BELHB23              51.17030                4.34100
2                      BELLD01              51.10998                5.00486
3                      BELLD02              51.12038                5.02155
4                      BELR833              51.32766                4.36226
..                         ...                   ...                    ...
61             Southend-on-Sea              51.54420                0.67841
62  Southwark A2 Old Kent Road              51.48050               -0.05955
63                    Thurrock              51.47707                0.31797
64      Tower Hamlets Roadside              51.52253               -0.04216
65        Groton Fort Griswold              41.35360              -72.07890

[66 rows x 3 columns]